/*!
\brief Клас відповідає за обробку виключних ситуацій
\author Ishchenko Vladyslav
\version 7
\date 8 грудня 2017
*/

class Errors
{
public:
	Errors(int t);///<Конструктор ініціалізації
	~Errors(); ///<Деструктор 
	void eVariety();///<Обробка помилки неправльно обраного варіанту з можливих
	void eNumber();///<Обробка помилик введення не числа
	void eRhesus();///<Обробка помилки не коректності введення резус-фактору
	void eBlood();///<Обробка помилки некоректності введення групи крові
	void eGender();///<Обробка помилки некоректності введення статі
	void error(); ///<Вибір типу помилки

private:
	int typeOfException;///<Тип помилки
};